#ცვლადი (variable) არის მეხსიერების უჯრა, სადაც ვინახავთ მონაცემს — მაგალითად რიცხვს, ტექსტს, ან სხვა მნიშვნელობას. ცვლადის გამოყენებით შეგვიძლია შემდეგში ეს მონაცემი მოვიხმაროთ.

#მონაცემთა ტიპი განსაზღვრავს, რა სახის მნიშვნელობაა შენახული ცვლადში.
#ძირითადი ტიპები, რაც ვისწავლეთ:

#int — მთელი რიცხვი (მაგ. 5, -10, 100)

#float — ათწილადი რიცხვი (მაგ. 3.14, -2.5)

#str — ტექსტი / სტრინგი (მაგ. "გამარჯობა")

#bool — ლოგიკური მნიშვნელობა (True ან False)

#ტერმინალი (Terminal) არის პროგრამა, სადაც შეგვიძლია პირდაპირი ბრძანებების შეყვანა კომპიუტერთან ან პროგრამასთან სასაუბროდ. Python-ის კოდსაც ტერმინალში ვუშვებთ.

#print() ეკრანზე აჩვენებს ტექსტს ან მნიშვნელობას.მას სჭირდება ფრჩხილები () იმისათვის, რომ იცოდეს — რა უნდა დაბეჭდოს.

#სინტაქსი ნიშნავს იმ წესებს, რომლის მიხედვითაც იწერება პროგრამა.თუ წესებს არ დავიცავთ — პროგრამა შეცდომას გვაჩვენებს (syntax error).

#კომენტარი არის კოდის ის ნაწილი, რომელიც პროგრამა არ ასრულებს — მხოლოდ ჩვენთვისაა, ახსნისთვის Python-ში კომენტარი იწყება  სიმბოლოთი.

# არასწორი ცვლადის სახელები
#ცვლადის სახელები არ შეიძლება:

#იწყებოდეს რიცხვით (2name )

#შეიცავდეს გამოტოვებას (my name )

#შეიცავდეს სპეციალურ სიმბოლოებს (my-name )

#ემთხვეოდეს Python-ის საკვანძო სიტყვას (if, print )

#ეს არის str() ფუნქცია.

"ორმაგი ბრჭყალი"

'ერთმაგი ბრჭყალი'

"""სამმაგი ბრჭყალი"""

True 

False 

# input() ფუნქცია input() მომხმარებელს ეკითხება მონაცემს ტერმინალში.

name = input("რა გქვია?: ")


# input() ყოველთვის აბრუნებს სტრინგსრაც არ უნდა შემოვიყვანოთ (რიცხვი, ტექსტი, ბულიანი), input() მას სტრინგად აღიქვამს.

# მათემატიკური ოპერაცია input()-ით რადგან input() აბრუნებს სტრინგს, უნდა გადავაქციოთ რიცხვად int()-ით:

a = int(input("პირველი რიცხვი: "))
b = int(input("მეორე რიცხვი: "))
print(a + b)


#low-level და high-level ენები

#Low-level ენები (მაგ. Assembly, C) ახლოს არიან კომპიუტერის "ენასთან" (მაშინათ მუშაობენ პირდაპირ მეხსიერებასთან). High-level ენები (მაგ. Python, Java, C#) მარტივად წასაკითხია ადამიანისთვის.

# რატომ არის low-level სწრაფი? იმიტომ რომ ისინი მუშაობენ უფრო ახლოს პროცესორთან და არ სჭირდებათ მრავალი "გადამყვანი" საფეხური (interpreting).

# პირობითი ოპერატორები (conditional operators) ეს არის ნიშანი, რომელიც ადარებს ორ მნიშვნელობას, მაგ. ==, >, <, >=, <=, !=.

# ლოგიკური ოპერატორები (logical operators)ამოწმებენ ლოგიკურ პირობებს:

#and — ორივე უნდა იყოს True

#or — ერთ-ერთი მაინც True უნდა იყოს

#not — პირიქით აქცევს მნიშვნელობას

#if-else statement
 
#if-else ნიშნავს: თუ პირობა მართალია — ერთი რამ გააკეთე, თუ არა — სხვა რამ, statement ნიშნავს ცალკე ბრძანებას პროგრამაში.

# შემთხვევები if-else-ში

#არსებობს ორი შემთხვევა:

#თუ პირობა True → შესრულდება if ნაწილი

#თუ False → შესრულდება else ნაწილი

#გამოიყენება გადაწყვეტილებების მისაღებად.

age = int(input("შეიყვანე შენი ასაკი: "))

if age > 18:
    print("დიდი ხარ")
else:
    print("პატარა ხარ")