month = int(input("შეიყვანე თვის ნომერი (1-12): "))

if month in (12, 1, 2):
    print("ზამთარი")
elif month in (3, 4, 5):
    print("გაზაფხული")
elif month in (6, 7, 8):
    print("ზაფხული")
elif month in (9, 10, 11):
    print("შემოდგომა")
else:

    print("არასწორი თვის ნომერი")







number = float(input("შეიყვანე რიცხვი: "))

if number > 0:
    print("დადებითია")
elif number < 0:
    print("უარყოფითია")
else:
    print("ნულთან ტოლია")








#if-ნიშნავს,თუ,ამოწმებს პირობას.

#elif-ნიშნავს წინააღმდეგ შემოთხვევაში თ,გამოიყენება სხვა ალტერნატიული პირობების შესამოწმებლად.

#else-ნიშნავს სხვა შემთხვევაში,გამოიყენება,თუ არცერთი ზემოთ მოცემული პირობა არ შესრულდა.







age = int(input("შეიყვანე ასაკი: "))
income = int(input("შეიყვანე შემოსავალი: "))

if age < 18 or income <10000:
    print("გათავისუფლებული ხარ გადასახადისგან")
else:
    print("გადასახადი გათასახდელია")






number = float(input("შეუიყვანე რიცხვი: "))

if number > 10:
    print("მეტია 1-ზე")
else:
    print("ნაკლებიაან ტოლია 10-ის")







