age = int(input("შეიყვანე შენი ასაკი: "))
print("შენი ასაკია:", age)


name = "andria"

print("hello" + name)


#input-ი არის პროგრამის შესრულების დროს მომხმარებლისგან მონაცემების მისაღებად.

#output-ი არის პროგრამა წარმოქმნის და აგზავნის გარე დანიშნულების ადგილამდე.

name = "gurami"

print(name)


#snake_case არის დასახელების კონვენცია, სადაც ფრაზაში სიტყვები გაერთიანებულია ინტერვალების გარეშე

#camel_case არის სახელდების კონვენცია, სადაც მრავალსიტყვიან იდენტიფიკატორში სიტყვები ერთმანეთთან დაკავშირებულია ინტერვალების გარეშე