# საყვარელი საწმელების სია
favoritefood  = ["სპაგეტი", "ტომატო", "ყველი", "პური", "მაიონეზი"]
print(favoritefood)


# ცისარტყელას ფერების სია
colors = ["წითელი", "ნარინჯისფერი", "ყვითელი", "მწვანე", "ლურჯი", "ლილაქი", "იისფერი"]

# ცივი ფერები: ლურჯი, ლილაქი, იისფერი
cold_colors = ["ლურჯი", "ლილაქი", "იისფერი"]
print(cold_colors)





# ცხოველების სია
animals = ["ლომი", "ვეფხვი", "მელა", "სპილო", "მაიმუნი"]

# მხოლოდ 1 და 2 ინდექსის ცხოველები
print(animals[1])  # ვეფხვი
print(animals[2])  # მელა







# პირველი სია
list1 = [10, 20, 30, 40]

# მეორე სია
list2 = [5, 15, 25, 35]

# 2 ინდექსი list1 -> 30, 3 ინდექსი list2 -> 35
result = list1[2] + list2[3]
print(result)  # 30 + 35 = 65






#თუ გვინდა რომ დავწეროთ სია მაშინ ასე უნდა შევიყვანოთ:ჯერ უნდა დავწეროთ list-ი და შემდეგ უნდა დავწეოთ ტოლობა და ან ფლოატი ან ინტენგრი და ან ბულიონი და ბოლოს დავწერთ პრინტს და დავწერთ list ისევ და ჩავსვავთ მერე ამ ჩვენ ბულიანს ან ფლოატს ან კიდე ინტენგერს