#მონაცემთა სტრუქტურა არის გზა ან მეთოდი, რომლის მეშვეობითაც კომპიუტერში ინახება და ორგანიზდება მონაცემები ისე, რომ მათზე ოპერაციები (დამატება, წაშლა, ძებნა და ა.შ.) იყოს მარტივი და ეფექტური.მაგალითად: სიები (list), ტაპლები (tuple), სიტყვარები (dictionary) და მრავლობები (set) — ესენი 모두 მონაცემთა სტრუქტურებია Python-ში

#სია (List) არის მონაცემთა სტრუქტურა, რომელიც საშუალებას გაძლევს ერთ ცვლადში შეინახო რამდენიმე მნიშვნელობა.მაგალითად, შეგიძლია ერთ სიაში შეინახო სტუდენტების სახელები ან რიცხვები.

#სია გამოიყენება მაშინ, როცა გვინდა ერთობლივად დავამუშავოთ ან შევინახოთ ელემენტების კოლექცია.

#სია იწერება კვადრატული ფრჩხილებით [], ხოლო ელემენტები გამოყოფილია მძიმით.

#შევქმნათ ჩვენი საკუთარი სია სახელებით.

students = "ana"
students1 = "nika"
students2 = "andrea"
students3 = "beka"
students4 = "lika"
print(students)
print(students1)
print(students2)
print(students3)  
print(students4)

#შეგვიძლია გამოვიყენოთ უარყოფითი ინდექსი -1, რომელიც ყოველთვის მიუთითებს ბოლო ელემენტზე:

print(students[-1])
 