# ეს while ციკლი დაბეჭდავს რიცხვებს 1-დან 5-მდე
i = 1  # ვიწყებთ i=1-ით
while i <= 5:  # ციკლი იმუშავებს მანამ, სანამ i ნაკლებია ან ტოლია 5-ზე
    print(i)  # ვბეჭდავთ i-ს
    i += 1  # i-ს ვუმატებთ 1-ს ყოველი გამეორების შემდეგ









# ეს for ციკლი დაბეჭდავს რიცხვებს 1-დან 5-მდე
for i in range(1, 6):  # range(1, 6) ნიშნავს 1-დან 5-მდე (6 არ შედის)
    print(i)  # ვბეჭდავთ i-ს









age = int(input("შეიყვანეთ თქვენი ასაკი: "))
if age > 18:
    print("you are big adult")












i = 1
total = 0

while i <= 100:
    total += i
    i += 1



print("1-დან 100-მდე რიცხვების ჯამია:", total)






