my_list = [10, 20, 30, 40]
print(my_list[1])




#append(x)	ამატებს ელემენტს სიის ბოლოში
#insert(i, x)	ჩასვამს ელემენტს i ინდექსზე
#remove(x)	შლის სიიდან პირველივე x ელემენტს
#pop()	შლის და აბრუნებს ბოლო ელემენტს
#pop(i)	შლის და აბრუნებს i ინდექსზე მყოფ ელემენტს
#clear()	ასუფთავებს მთელ სიას
#index(x)	აბრუნებს x ელემენტის პირველ ინდექსს
#count(x)	ითვლის რამდენჯერ გვხვდება x სიაში
#sort()	ალაგებს სიას ზრდადობით (საბუთებული ელემენტების შემთხვევაში)
#reverse()	აბრუნებს სიას უკუღმა
#copy()	ქმნის სიის ასლს





def test1():
    print("Hello")
def test2():
    return "Hello"
a = test1()
b = test2()



