# == (ტოლობა): ამოწმებს, არის თუ არა ორი მნიშვნელობა ერთმანეთის ტოლი

# != (არათოლობა): ამოწმებს, არ არის თუ არა ორი მნიშვნელობა ერთმანეთის ტოლი

# > (მეტობა): ამოწმებს, არის თუ არა მარცხენა მნიშვნელობა მარჯვენაზე მეტი

# < (ნაკლებობა): ამოწმებს, არის თუ არა მარცხენა მნიშვნელობა მარჯვენაზე ნაკლები

# >= (მეტია ან ტოლი): ამოწმებს, არის თუ არა მარცხენა მნიშვნელობა მარჯვენაზე მეტი ან ტოლი

# <= (ნაკლებია ან ტოლი): ამოწმებს, არის თუ არა მარცხენა მნიშვნელობა მარჯვენაზე ნაკლები ან ტოლი

# and ოპერეტორი აბრუნებს true-ს როდესაც პირობამ არის true მხოლო იმ პირობით აბრუნებს false როდესაც პირობა არის false

# or ოპერატორი აბრუნებს True-ს მაშინაც კი, თუ მხოლოდ ერთი პირობა მაინც არის True მხოლოდ მაშინ აბრუნებს False-ს, როცა ორივე პირობა False-ია.

print(True and 6 < 7 or "hello" != 5.4 and False or 7 - 7 < 9 + 2)

# აქ წერია and და or 
# აქ წერია intengeri
# აქ წერია true da false
# აქ წერია <,!=
# აქ წერია stringi
# აქ წერია float
# აქ წერია მათემატკური ოპერაციები


#ჩვენ შეგვიძლია გამოვიყენოთ მხოლოდ and

print(True and False)
print(False and False)
print(True and True)

print(True or True)
print(True or False)
print(False or False)